---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LockOverconstrainedAlignment
source: html/e89c7664-b123-4794-3bd9-fc94d4ac5eb3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LockOverconstrainedAlignment Property

Locking this alignment would overconstrain the sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId LockOverconstrainedAlignment { get; }
```